import java.io.Serializable;

public class TableClass implements Serializable{

    String[][] stLab = new String[50][19];
    String[][] stHomeworce = new String[50][19];
    String[][] stLeckcei = new String[50][19];
    String[][] stKurs = new String[50][4];
    String[][] stObh = new String[50][6];

    String[] stlab = {"Список студентов", "Лаб-1", "Лаб-2", "Лаб-3", "Лаб-4", "Лаб-5",
            "Лаб-6", "Лаб-7", "Лаб-8", "Лаб-9", "Лаб-10", "Лаб-11", "Лаб-12", "Лаб-13",
            "Лаб-14", "Лаб-15", "Лаб-16", "Лаб-17", "Баллы"};

    String[] sthomeworce = {"Список студентов", "Д/З-1", "Д/З-2", "Д/З-3", "Д/З-4", "Д/З-5",
            "Д/З-6", "Д/З-7", "Д/З-8", "Д/З-9", "Д/З-10", "Д/З-11", "Д/З-12", "Д/З-13",
            "Д/З-14", "Д/З-15", "Д/З-16", "Д/З-17", "Баллы"};

    String[] stleckcei = {"Список студентов", "Лекция 1", "Лекция 2", "Лекция 3", "Лекция 4",
            "Лекция 5", "Лекция 6", "Лекция 7", "Лекция 8", "Лекция 9", "Лекция 10", "Лекция 11",
            "Лекция 12", "Лекция 13", "Лекция 14", "Лекция 15", "Лекция 16", "Лекция 17", "Баллы"};

    String[] stkurs = {"Список студентов", "Тема Курсовой", "Оценка", "Баллы"};

    String[] stobh = {"Список студентов", "Лабораторные", "Домашние Задания", "Лекции", "Курсовая", "Общий Балл"};

    public String[][] getStLab(){
        return stLab;
    }

    public String[][] getStObh(){
        return stObh;
    }


}
